app/controllers/line_items_controller.rb

SELECT  "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", 27]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", "2015-03-25 23:21:01.348955"], ["updated_at", "2015-03-25 23:21:01.348955"]]
INSERT INTO "line_items" ("product_id", "cart_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["product_id", 27], ["cart_id", 1], ["created_at", "2015-03-25 23:21:01.411882"], ["updated_at", "2015-03-25 23:21:01.411882"]]
---
  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.line_items.build(product: product)

    respond_to do |format|
      if @line_item.save